Tests/Fixtures/Extensions/expected.hidden.mmd
classDiagram
    class Codable {
        <<protocol>>
    }
    class Profile {
        <<struct>>
    }
    class Team {
        <<struct>>
        [User] users
    }
    class User {
        <<struct>>
        Profile profile
        make() User$
        mutating rename(to name: String)
    }
    Team o-- User : users
    User *-- Profile : profile
